PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
#include <stdio.h>
#include <inttypes.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "config_manager.h"
#include "esp32_id_manager.h"
#include "wifi_manager.h"
#include "wifi_captive_portal.h"
#include "mqtt_manager.h"
#include "time_manager.h"
#include "watchdog_manager.h"
#include "relay_manager.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "config_processor.h"
#include "esp_timer.h"
#include "cJSON.h"

static const char *TAG = "HDDESP32";

static bool g_system_initialized = false;
static bool g_wifi_connected = false;
static bool g_mqtt_connected = false;
static bool g_watchdog_available = false;
static bool g_relay_manager_initialized = false;
static bool g_need_reregister = false;

static void force_heap_cleanup(void) {
    for (int i = 0; i < 3; i++) {
        heap_caps_check_integrity_all(true);
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

static void print_memory_info(void) {
    size_t free_heap = esp_get_free_heap_size();
    size_t min_heap = esp_get_minimum_free_heap_size();
    size_t largest_block = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
    
    ESP_LOGI(TAG, "=== Memory Status ===");
    ESP_LOGI(TAG, "Free heap: %zu bytes", free_heap);
    ESP_LOGI(TAG, "Minimum free heap: %zu bytes", min_heap);
    ESP_LOGI(TAG, "Largest free block: %zu bytes", largest_block);
    
    if (g_watchdog_available) {
        esp_err_t ret = watchdog_manager_report_activity(WATCHDOG_CHECK_MEMORY);
        if (ret != ESP_OK) {
            ESP_LOGD(TAG, "Could not report memory activity to watchdog");
        }
    }
    
    if (free_heap < 50000) {
        ESP_LOGW(TAG, "Low memory warning: %zu bytes", free_heap);
        if (free_heap < 30000 && g_watchdog_available) {
            esp_err_t mode_ret = watchdog_manager_set_mode(WATCHDOG_MODE_CRITICAL);
            if (mode_ret != ESP_OK) {
                ESP_LOGD(TAG, "Could not set watchdog to critical mode");
            }
        }
    }
}

static void watchdog_event_callback(watchdog_health_status_t status, watchdog_check_type_t check_type, void *user_data) {
    const char* status_str = "UNKNOWN";
    const char* check_str = "UNKNOWN";
    
    switch (status) {
        case WATCHDOG_HEALTH_GOOD: status_str = "GOOD"; break;
        case WATCHDOG_HEALTH_WARNING: status_str = "WARNING"; break;
        case WATCHDOG_HEALTH_CRITICAL: status_str = "CRITICAL"; break;
        case WATCHDOG_HEALTH_ERROR: status_str = "ERROR"; break;
    }
    
    switch (check_type) {
        case WATCHDOG_CHECK_MEMORY: check_str = "MEMORY"; break;
        case WATCHDOG_CHECK_WIFI: check_str = "WIFI"; break;
        case WATCHDOG_CHECK_MQTT: check_str = "MQTT"; break;
        case WATCHDOG_CHECK_TASKS: check_str = "TASKS"; break;
    }
    
    ESP_LOGW(TAG, "Watchdog event: %s - %s", check_str, status_str);
    
    if (status == WATCHDOG_HEALTH_CRITICAL) {
        switch (check_type) {
            case WATCHDOG_CHECK_MEMORY:
                ESP_LOGE(TAG, "Critical memory situation detected");
                mqtt_manager_emergency_memory_cleanup();
                break;
                
            case WATCHDOG_CHECK_WIFI:
                ESP_LOGE(TAG, "Critical WiFi failure detected");
                if (!wifi_manager_is_connected()) {
                    char ap_ssid[33];
                    esp_err_t ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel");
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "Starting emergency AP mode: %s", ap_ssid);
                        wifi_manager_start_ap_mode(ap_ssid, "firepanel");
                    }
                }
                break;
                
            case WATCHDOG_CHECK_MQTT:
                ESP_LOGE(TAG, "Critical MQTT failure detected");
                char esp32_id[ESP32_ID_LENGTH + 1];
                if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                    mqtt_manager_set_esp32_id(esp32_id);
                    mqtt_manager_connect();
                }
                break;
                
            case WATCHDOG_CHECK_TASKS:
                ESP_LOGE(TAG, "Critical task failure detected");
                break;
        }
    } else if (status == WATCHDOG_HEALTH_WARNING) {
        ESP_LOGW(TAG, "System degradation detected in %s subsystem", check_str);
    }
}

static void relay_state_change_callback(const relay_event_t *event, void *user_data) {
    if (!g_mqtt_connected) {
        ESP_LOGD(TAG, "MQTT not connected, skipping relay event");
        return;
    }
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_TASKS);
    }
    
    size_t free_heap = esp_get_free_heap_size();
    if (free_heap < 20000) {
        ESP_LOGW(TAG, "Insufficient memory for relay event: %zu bytes", free_heap);
        return;
    }
    
    char esp32_id[ESP32_ID_LENGTH + 1];
    if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) != ESP_OK) {
        ESP_LOGE(TAG, "Could not get ESP32 ID for relay event");
        return;
    }
    
    char *json_buffer = heap_caps_malloc(512, MALLOC_CAP_8BIT);
    if (!json_buffer) {
        ESP_LOGE(TAG, "Failed to allocate relay event buffer");
        return;
    }
    
    memset(json_buffer, 0, 512);
    
    int64_t timestamp_ms = event->timestamp / 1000;
    
    int len = snprintf(json_buffer, 512,
                      "{"
                      "\"relay\":\"%s\","
                      "\"status\":\"%s\","
                      "\"timestamp\":%lld,"
                      "\"contact_type\":\"%s\","
                      "\"old_status\":\"%s\""
                      "}",
                      event->relay_id,
                      (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC",
                      (long long)timestamp_ms,
                      (event->contact_type == RELAY_CONTACT_NC) ? "NC" : "NO",
                      (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC");
    
