PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
                if (relay_name && is_active) {
                    relay_manager_set_active(relay_name, cJSON_IsTrue(is_active));
                    ESP_LOGI(TAG, "Relay %s %s", relay_name,
                            cJSON_IsTrue(is_active) ? "ACTIVATED" : "DEACTIVATED");
                    
                    cJSON *contact_type = cJSON_GetObjectItem(json, "contact_type");
                    if (contact_type && cJSON_IsString(contact_type)) {
                        const char *type_str = cJSON_GetStringValue(contact_type);
                        relay_contact_type_t type = strcmp(type_str, "NC") == 0 ? 
                                                RELAY_CONTACT_NC : RELAY_CONTACT_NO;
                        relay_manager_set_contact_type(relay_name, type);
                        ESP_LOGI(TAG, "Relay %s contact type set to %s", relay_name, type_str);
                    }
                    
                    cJSON *custom_name = cJSON_GetObjectItem(json, "custom_name");
                    if (custom_name && cJSON_IsString(custom_name)) {
                        const char *name_str = cJSON_GetStringValue(custom_name);
                        if (name_str && strlen(name_str) > 0) {
                            relay_manager_set_name(relay_name, name_str);
                            ESP_LOGI(TAG, "Relay %s custom name set to '%s'", relay_name, name_str);
                        }
                    }
                }
            }
            cJSON_Delete(json);
        }
    }
}

static void wifi_state_callback(wifi_manager_state_t state, void *user_data) {
    char esp32_id[ESP32_ID_LENGTH + 1];
    
    switch (state) {
        case WIFI_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "WiFi connected");
            g_wifi_connected = true;
            
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            time_manager_sync_time();
            
            if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                if (mqtt_manager_set_esp32_id(esp32_id) == ESP_OK) {
                    mqtt_manager_connect();
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "WiFi disconnected");
            g_wifi_connected = false;
            g_mqtt_connected = false;
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_AP_MODE:
            ESP_LOGI(TAG, "WiFi AP mode active");
            g_wifi_connected = false;
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        default:
            break;
    }
}

static void on_wifi_connect_callback(void *user_data) {
    ESP_LOGI(TAG, "WiFi configured via captive portal");
    
    if (wifi_captive_portal_is_active()) {
        wifi_captive_portal_stop();
        esp_wifi_set_mode(WIFI_MODE_STA);
    }
}

static void system_monitor_task(void *pvParameters) {
    ESP_LOGI(TAG, "System monitor task started");
    
    bool task_watchdog_available = false;
    
    if (g_watchdog_available) {
        esp_err_t wd_ret = watchdog_manager_register_task(NULL, "sys_monitor");
        if (wd_ret == ESP_OK) {
            ESP_LOGI(TAG, "System monitor task registered in watchdog manager");
            task_watchdog_available = true;
        } else {
            ESP_LOGW(TAG, "Failed to register in watchdog manager: %s", esp_err_to_name(wd_ret));
        }
    }
    
    if (!task_watchdog_available) {
        ESP_LOGW(TAG, "Watchdog manager not available, using default ESP-IDF TWDT");
        esp_err_t twdt_ret = esp_task_wdt_add(NULL);
        if (twdt_ret == ESP_OK) {
            ESP_LOGI(TAG, "System monitor task registered in default TWDT");
        } else {
            ESP_LOGW(TAG, "Failed to register in default TWDT: %s", esp_err_to_name(twdt_ret));
        }
    }
    
    uint32_t cycle_count = 0;
    
    while (1) {
        if (task_watchdog_available) {
            watchdog_manager_feed();
        } else {
            esp_task_wdt_reset();
        }
        
        cycle_count++;
        
        if (cycle_count % 60 == 0 && g_relay_manager_initialized) {
            ESP_LOGI(TAG, "Performing periodic relay check");
            relay_manager_check_all_states(false);
        }
        
        if (time_manager_should_send_network_info() || g_need_reregister) {
            ESP_LOGI(TAG, "Sending network info %s", g_need_reregister ? "after deletion notification" : "after NTP synchronization");
            esp_err_t ret = mqtt_manager_send_network_info();
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "Network info sent successfully");
                time_manager_mark_network_info_sent();
                g_need_reregister = false;
            } else {
                ESP_LOGW(TAG, "Failed to send network info: %s", esp_err_to_name(ret));
            }
        }
        
        size_t free_heap = esp_get_free_heap_size();
        if (free_heap < 40000) {
            ESP_LOGW(TAG, "Low memory detected: %zu bytes - Performing emergency cleanup", free_heap);
            
            if (mqtt_manager_is_connected()) {
                ESP_LOGI(TAG, "Triggering MQTT memory cleanup");
                mqtt_manager_emergency_memory_cleanup();
            }
            
            force_heap_cleanup();
            
            size_t free_after = esp_get_free_heap_size();
            ESP_LOGI(TAG, "Memory after cleanup: %zu bytes (recovered: %d bytes)", 
                    free_after, (int)(free_after - free_heap));
        }
        
        if (cycle_count % 360 == 0) {
            force_heap_cleanup();
        }
        
